// Задача 1.
// Напишите цикл, который выводит числа от 1 до 20, но пропускает те числа, которые делятся на 4 без остатка.

let number = 20;

for (let i = 1; i <= number; i++) {
  if (i % 4 === 0) {
    console.log(i);
  }
}

// Задача 2.
// С помощью цикла for вычислите факториал числа (произведение всех чисел от 1 до заданного числа). Используйте prompt для получение начального значения. ! 1 2 3 4 5

let factorial = +prompt("Факториал");
let totalFactorial = 1;

for (let i = 1; i <= factorial; i++) {
  totalFactorial *= i;
}
console.log(totalFactorial);

// *Задача 3.
// Выведите в консоль шахматную доску размером 8x8, где символы чередуются (например, # и пробел). Начинайте с # в первой ячейке первой строки.

let board = "";

for (let i = 1; i <= 8; i++) {
  let row = " ";
  for (let j = 1; j <= 8; j++) {
    if (j % 2 === 0) {
      row += "Б ";
    } else {
      row += "Ч ";
    }
  }
  board += row + "\n";
}

console.log(board);
