// Задача 1.
// Напишите условие, которое будет проверять чётное ли число, используйте оператор if.

const even = +prompt("Введите число:");

if (even % 2 === 0) {
  console.log("Число четное");
} else {
  console.log("Число не четное");
}

// Задача 2.
// 1. Объявите переменную age с числовым значением.
// 2. С помощью тернарного оператора (вложенного, если нужно) присвойте переменной discount значение скидки:
//    2.1. Если age меньше 18 – скидка 10%.
//    2.2. Если age от 18 до 65 (включительно) – скидка 20%.
//    2.3. Если age больше 65 – скидка 30%.
// 3. Выведите значение discount в консоль.

const age = +prompt("Сколько вам лет, введите число?");

const discount =
  age < 18
    ? `Ваша скидка - 10%`
    : age >= 18 && age <= 65
      ? `Ваша скидка - 20%`
      : `Ваша скидка - 30%`;

console.log(discount);

// 4. *Дополнительное задание: перепишите задачу на switch-case.

switch (true) {
  case age < 18:
    console.log(`Ваша скидка - 10%`);
    break;
  case age >= 18 && age <= 65:
    console.log(`Ваша скидка - 20%`);
    break;
  case age > 65:
    console.log(`Ваша скидка - 30%`);
    break;
}

// Задача 3.
// 1. Объявите переменные username и password.
//    Допустимые варианты имени пользователя — это "admin" или "user", а пароль должен быть равен "123456".
// 2. Если выполняется условие:
//     (username равен "admin" или "user") и пароль равен "123456"
//     то выведите сообщение "Доступ разрешен", иначе — "Доступ запрещен".
// 3. Используйте prompt для ввода имени пользователя и пароля.

const USER_NAME = String(
  prompt("Введите логин admin / user - другие не допускаются"),
);
const PASSWORD = +prompt("Введите пароль:");

switch (true) {
  case USER_NAME === "admin" || (USER_NAME === "user" && PASSWORD === 123456):
    console.log("Доступ разрешен!");
    break;
  default:
    console.log("Доступ запрещен!");
}

if (USER_NAME === "admin" || USER_NAME === "user") {
  if (PASSWORD === 123456) {
    console.log("Доступ разрешен!");
  } else {
    console.log("Пароль указан неверно!");
  }
} else {
  console.log("Доступ запрещен!");
}

// *Задача 4.
// Создайте программу, которая рассчитывает стоимость доставки посылки, основываясь на весе и типе доставки. Программа должна запрашивать у пользователя данные с помощью prompt и выводить результат через alert.

// 1. Ввод данных:
//    1.1. Запросите у пользователя вес посылки (в килограммах).
//    1.2. Запросите у пользователя тип доставки. Допустимые варианты:
//        "Стандарт"
//        "Экспресс"
//        "Премиум"

// 2. Проверка корректности данных:
//    2.1. Если вес меньше или равен 0, выведите сообщение об ошибке: "Некорректный вес посылки".
//    2.2. Если введён тип доставки, который не соответствует ни одному из ожидаемых вариантов, выведите сообщение: "Неверный тип доставки".

// 3. Расчёт базовой стоимости доставки:
//    3.1. Определите базовую стоимость в зависимости от веса посылки:
//        Если вес меньше 1 кг, базовая стоимость — 5$.
//        Если вес от 1 кг до 5 кг (включительно), базовая стоимость — 10$.
//        Если вес больше 5 кг, базовая стоимость — 15$.

//    Для определения базовой стоимости можно использовать конструкцию if...else или тернарный оператор.

// 4. Определение коэффициента по типу доставки:
//     Используйте конструкцию switch-case для назначения коэффициента:
//        "Стандарт": коэффициент 1
//        "Экспресс": коэффициент 1.5
//        "Премиум": коэффициент 2

// 5. Расчёт итоговой стоимости доставки:
//    Итоговая стоимость = базовая стоимость * коэффициент.

// 6. Вывод результата:
//    С помощью alert выведите итоговую стоимость доставки, например: "Итоговая стоимость доставки: 15$."

const weight = +prompt("Укажите вес посылки в кг:");
const type = String(
  prompt(`Укажите тип доставки: "Стандарт" "Экспресс" "Премиум"`),
);

let base = undefined;
let factor = undefined;

if (weight <= 0) {
  console.log(`Некорректный вес посылки`);
  alert(`Некорректный вес посылки`);
} else if (type !== "Стандарт" && type !== "Экспресс" && type !== "Премиум") {
  console.log(`Неверный тип доставки`);
  alert(`Неверный тип доставки`);
} else if (weight < 1) {
  console.log(`базовая стоимость — 5$`);
  base = 5;
} else if (weight <= 5 || weight === 1) {
  console.log(`базовая стоимость — 10$`);
  base = 10;
} else {
  console.log(`базовая стоимость — 15$`);
  base = 15;
}

switch (type) {
  case "Стандарт":
    factor = 1;
    console.log(`Кеф - 1`);
    break;
  case "Экспресс":
    factor = 1.5;
    console.log(`Кеф - 1.5`);
    break;
  case "Премиум":
    factor = 2;
    console.log(`Кеф - 2`);
    break;
}

let result = base * factor;
alert(`Итоговая стоимость доставки: ${result}`);
console.log(`Итоговая стоимость доставки: ${result}`);
